عزيزي الطالب {{ $studentName }}،

نشكرك على اهتمامك بالانضمام إلى جامعة أكتوبر للعلوم الحديثة والآداب (MSA)، صاحبة أعلى توثيق وشراكة بريطانية في مصر.

نؤكد لك استلام بيانات تسجيلك المبدئي بنجاح، ونود مشاركتك التعليمات الخاصة باستكمال خطوات التقديم:

التسجيل عبر منصة «ادرس في مصر»

نود إعلامك بأن فترة التقديم للفصل الدراسي الأول عبر منصة «ادرس في مصر» قد انتهت، بينما لم يُفتح بعد باب التسجيل للفصل الدراسي الثاني (فبراير 2027).

لذلك، لا يلزمك اتخاذ أي إجراء عبر المنصة في الوقت الحالي. يرجى متابعة بريدك الإلكتروني، حيث سنرسل إليك رسالة فور فتح باب التسجيل، تتضمن الخطوات المطلوبة لاستكمال طلبك واختيار جامعة MSA.

ويمكنك من الآن التعرف على شروط القبول والمصروفات الدراسية والمستندات المطلوبة من خلال دليل القبول للطلاب الوافدين:

https://go.msa.edu.eg/iraq-email

يرجى متابعة بريدك الإلكتروني، فنحن على تواصل معك.

نتطلع إلى الترحيب بك قريبًا في جامعة أكتوبر للعلوم الحديثة والآداب (MSA).

مع خالص التحية والتقدير،
مكتب التقديم والقبول – جامعة MSA
الخط الساخن: 16672
