عزيزي وليّ الأمر،

نشكركم على اهتمامكم بانضمام نجلكم/نجلتكم إلى جامعة أكتوبر للعلوم الحديثة والآداب (MSA)، صاحبة أعلى توثيق وشراكة بريطانية في مصر.

يسعدنا تأكيد استلام التسجيل المبدئي لنجلكم/نجلتكم، ونود مشاركتكم التعليمات الخاصة باستكمال خطوات التقديم:

التسجيل عبر منصة «ادرس في مصر»

نود إعلامكم بأن فترة التقديم للفصل الدراسي الأول عبر منصة «ادرس في مصر» قد انتهت، بينما لم يُفتح بعد باب التسجيل للفصل الدراسي الثاني (فبراير 2027).

لذلك، لا يلزم نجلكم/نجلتكم اتخاذ أي إجراء عبر المنصة في الوقت الحالي. يرجى متابعة البريد الإلكتروني، حيث سنرسل إليكم رسالة فور فتح باب التسجيل، تتضمن الخطوات المطلوبة لاستكمال الطلب واختيار جامعة MSA.

ويمكنكم من الآن التعرف على شروط القبول والمصروفات الدراسية والمستندات المطلوبة من خلال دليل القبول للطلاب الوافدين:

https://go.msa.edu.eg/iraq-email

يرجى متابعة بريدكم الإلكتروني، فنحن على تواصل معكم.

نتطلع إلى الترحيب بنجلكم/نجلتكم قريبًا في جامعة  (MSA).

مع خالص التحية والتقدير،
مكتب التقديم والقبول – جامعة MSA
الخط الساخن: 16672
